[
    "What did the ocean say to the beach? Nothing, it just waved.",
    "What do you call a poor Santa Claus? St. Nickel-less.",
    "What's the best thing about Switzerland? I don't know, but the flag is a big plus.",
    "Where do boats go when they're sick? To the boat doc.",
    "Why couldn't the bicycle stand up by itself? It was two tired.",
    "Why did Billy get fired from the banana factory? He kept throwing away the bent ones.",
    "I don't trust stairs. They're always up to something.",
    "How do you make a tissue dance? You put a little boogie in it.",
    "What kind of shoes do ninjas wear? Sneakers!",
    "If a child refuses to nap, are they guilty of resisting a rest?",
    "Did you hear about the kidnapping at school? It's okay, he woke up.",
    "What country's capital is growing the fastest? Ireland. Every day it's Dublin.",
    "What's brown and sticky? A stick.",
    "What do you call a hot dog on wheels? Fast food!",
    "What’s an astronaut’s favorite part of a computer? The space bar.",
    "What do you call it when a group of apes starts a company? Monkey business.",
    "Did you hear about the monkeys who shared an Amazon account? They were Prime mates.",
    "What do you say when you lose a nintendo game? I want a wii-match!",
    "What do you call the Nintendo Wii in France? A Nintendo Yes!",
    "What do you call a fake noodle? An impasta.",
    "Why are elevator jokes so classic and good? They work on many levels.",
    "I don't play soccer because I enjoy the sport. I'm just doing it for kicks!",
    "I wouldn't buy anything with velcro. It's a total rip-off.",
    "When does a joke become a dad joke? When it becomes apparent.",
    "Don't trust atoms. They make up everything!",
    "I could tell a joke about pizza, but it's a little cheesy.",
    "Spring is here! I got so excited I wet my plants.",
    "How do lawyers say goodbye? We'll be suing ya!",
    "I'm so good at sleeping, I can do it with my eyes closed!",
    "I was going to tell a time-traveling joke, but you guys didn't like it.",
    "I ordered a chicken and an egg online. I’ll let you know.",
    "I like telling Dad jokes. Sometimes he laughs!",
    "What do you call an elephant that doesn't matter? An irrelephant.",
    "What do you get from a pampered cow? Spoiled milk.",
    "Why can't you hear a psychiatrist using the bathroom? Because the 'P' is silent.",
    "You know, people say they pick their nose, but I feel like I was just born with mine.",
    "I decided to sell my vacuum cleaner—it was just gathering dust!",
    "I've got a great joke about construction, but I'm still working on it.",
    "Did you hear about the guy who invented the knock-knock joke? He won the 'no-bell' prize.",
    "I'm reading a book about anti-gravity. It's impossible to put down!",
    "Why do seagulls fly over the sea? Because if they flew over the bay, they would be bagels!" 
]
